# Даны строки S, S1 и S2. Заменить в строке S все вхождения строки S1 на строку S2.

# Вводим строки
S = input('')
S1 = input('')
S2 = input('')

# Меняем строки
print(S.replace(S1, S2))